//▒▓▒▓▒▒▒▒▒▒▒▒▒▓▓██▒▒▓▓▓▒▒▓██▓█▓██▓▓▒▒▒▒▒▒▒▒▓▓▓▓▓▓▓█▓▓▒▓▓█▓████▓█████▓▒▓▓███▓▓▓▒▒▒▒▒▓▓▒▒▒▓▓▓▓▓▓▓█▓▓▓█▓▓▓██▓█▓▓▓▓▓▓▓▓██▓▓▓▓▓▓▓▓▓██▓█▓█▓████▓▓▓▓▓▒▒▓▓▓▓▓█████▓▓█▓▓▓█▓
//▒▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▒▒▒▒▒▒▒▒▒▒▓▓▒▓█▓▓▓▓▒▒▒▒▒▒▒▒▓▓▓▓██▒▓▓▓▒▒█▓▓▓███████▓▓▓█▓▓███▓▓▓▒▒▒▒▒▒▒▒▒▒▓▒▒▒▓▓██▓▒▓▓████▓▓▓▓█▓▒▒▒▒▓▓▓▓███▓▓▓███▓▓▓▓█▓▒▓▓▓████▓▓▓█▓▓▓▓▓████▓▓▓█▓▓█
//▒▓▓▓▓▓▓▓▓▓▓▓▓▓▒▒▓▓▓▓▓▒▓▒▒▓▓█▓█▓▒▒▒▒▒▒▒▒▒▒▓█▓█▓█▓▓▓▓▒▒▒▒▒▒▓▓▓▓█▓█████▓▒▒▒▓█▓▓█▓▓▓▒▒▒▒▒▒▒▒▒▒▒▓▓▓█▓█▓█▓▓▓█▓▓▒▓▓▒▒▒▒▒▒▒▓▒▓█▓▓▓▓▓▓█▓▓▓▓▓▒▒▓▓▓▓▓▓▓█▓▓▓▓▓▓██▓▓██▓▓█▓▓▓█▓
//▒▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▒▓▓▓▓▓▓▒▒▒▒▒▒▒▒▒▒▓▓██▓▓▓███▓▒▒▒▒▓▓▓▓▓▓▓███▓▓▓█▒▓█▓▓▓▒▓▓▓▓▓▓▓▒▒▒▒▒▒▒▒▓▓▓▓▓█▓██████▓▓▒▒▒▒▒▓▓▓▓▒▓█▓▓███▓██▓▓▓▒▒▒▓▓▓▓█▓▓▓▓▓▓██▓██████████▓▓▓▓
//▒▒▒▓▓▓▓▓▓▓███▓█▓█▓▓▓▓▓▓▓▓▓▓▓▒▒▒▓▒▒▒▒▒▒▒▒▒▒▓▓▓▓██▒▓█▓▒▒▒▓▓██▓▒▓▓▓███▓▓▓▓▓▓▓▓▓▓█▓▓▓▓▓▓▓▒▒▓▓▓▒▒▓▓▓▓████▓▓█▓█▓▓▓▓▒▓██▓█▓▓▓█▓▓▓█▓▓█▓▓▓▒▒▒██████▓▓▒▓▓▓▓▓█▓▓▓█▓▓█▓▓▓▓▓▓▓
//▓▒▒▒▓▓▓▓▓▓███▓██▓▓█▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▒▒▒▒▒▒▒▓▓▓▓█▓▓▓██▓▓▒▓▓▓██▓▓█▓█▓█▓█████▓▓▓▓▒▓██▓▒▒▓▓▓▓▓▓▓▓▓▒▓▓█▓███▓▓▓█▓▓▓▓▓▓█▓▒▒▓▓█▓▓▓██▓▓█▓▓▓▓▓▒██▓▒▓▓▓█▓▒▒▓█▓███▓▓▓█▒▓▓▓▒▒▒▒▓
//▓▓▒▒▒▓▓▓▓▓▓███▓█▓▓▓▓▓▓▓▓█▓▓▓▓▓▒▓▒▒▒▒▒▒▒▒▒▓▓▓█▓▓▓▓▓▓▓▓▓██▓██████████▓▓▓▓▓█▓▓█▓▓█▓▓█▓█▓█▓███▓▓▒▓▓▓███▓▒▓▓▓▓▒▒▓▓█▓▓█▓▓█▓▓█▓▓▓▓▓▓▓▓▓▓▓▓█▓▓█▓▓▓▓▓▓▓▓█▓█▓▓█▓▓▓▒▓▒▒▒▒▒▓▓
//▒▒▒▓▒▒▒▓▓▓▓▓▓▓▓▓▓▓▓▒▓▓▓▓▓▒▒▒▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▓▓▓▓███▓▓█▓▓▒▓██▓█▓▓█▓▓████▓▓▓▓▒▒▓█▓▓███▓▓▒▒▓███▓▓▓▓█▓▓▓▓▓▓▒▒▒▒▓█▓█▓▓█▓█▓▓▓▒▒▓▓▓▒▒▒▒▓▓██▓▓▓▓▓▓▓███▓▓▓▓▒▓▓▓▓▓▓▓▒▒▒▒▓█▓
//▓▓▓█▓▓▓▓▓▒▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓██▓▓▓▓▒▒▒▒▒▒▒▒▒▒▒▒▒▓▓█▓▓▓█████▓█████▓█▓███▓▓▓▓▓█▓▒▒▒▓▓▓▓█▓██▓▓███▓█▓▒▓█▓▓█▓▒▒▒▒▒▒▓▓▓▒▒▓█▒▓▓▓▓█████▓▓▒▒▒▒▒▒▓▓█▓█▓█▓▓█▓▓▓▒▒▒▓▓▓▓▓▓▓▒▓▓█▓██
//█▓▓███▓▒▓▓▓▒▓▓▓██▓███████▓▓▓▒▒▓▓▒▒▓▒▒▒▒▒▒▒▒▒▓▓▓█▓▓█▓████████▓▓▓▓████▓▒▓▓▓▒▒▒▒▒▓▓██▓▓▓█▓▓█▓▓█▓██▒▒▓▓▓▓▒▓▓▒▒▓▓▓▓▓▓▓▓▒▒▓▒▒▓▓▓▓▓▒▒▒▒▒▒▒▓▓▓▓▓▓█▓▓█████▓▒▒▓█▓▓▓▓▓▒▒███▓
//▒▓▓████▓▒▓▓▓▓▓███▓▓████▓▓▓▓▓▓▓▓▓▓▓▒▓▒▒▒▒▒▒▒▒▒▒▒▓▒▒▒▓▓▓██████▓▓▓█▓▓█▓█▓▒▒▒▒▒▒▓▓▓▓▓██▓▒█▓▓▓▓▓▓▒▓▓▓▓▓██▓█▓▓▓▒▓▓▓▓▓▓▓▓▓▓▓▓▒▓▓▓▓▓▓▒▒▒▒▒▓▓▒▓▒▒▒▓▒▓▓▓▓█▓▓▓██▓▓▓██▒▓▓▓█▒▓
//▓█████▓▓▓▓▓▓▓████▓▓▓▓██▓▓▓▓▓▓▓▓▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▓▓██▓▒▓████▓█▓▒▒▒▓▓▓▓▒▓▓▒▒▒▒▓▓▓▒▓▓█▓▓▓█▓▓█▓▓▒▓▓▓█▓▒▒█▒▒▒▒▓▓▓▓█▓▓█▓▓▓▓▓▓▓▓▓▓▓▓▓▓▒▒▓▒▓▓▒▒▒▒▒▓▓▓▓█▒▓██▓█▓▓▓███▓▓█▓▓█
//██████▓▓▓▓▓▓▓▓▓██████▓▓▓▓▓▒▓▓▒▒▓▓▒▓▓▒▒▒▒▒▒▒▒▒▒▒▓▓█▓▓█▓▓▓▓▓██▓▓▒▒▓█▓▓▓▓▓▓▓▓▓▓▓▓▓▓█▓█▓▓▒▓█▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓█▓██▓███▓▓██▓▓▓▓▓▓▓▓▓▒▓▒▒▒▒▒▒▓▒▒▒▒▓▓▓▓█▓█▓▓▓▓▓▓▓▓▓█▓▓▒▓█▓
//███▓▓▓▓▓▓▒▓▓▓▓█████▓▓▓▓▓▓▒▒▒▒▓▓█▓▓█▓▒▒▒▒▒▒▒▒▒▒▒▓▓▓█▓▓▓▓█▓███▓█▓▓▓▓▓▓▓▓▒▒▓▓▓▓▓█▓▓▓▓▓▓▓▓▓▓▓█▓▓▓████▓▓▓▓▓██████▓▓▓▓▓▓▓▒▓▓▓▓▓▒▓▓▓▓▓▓▓▓▒▒▒▒▒▒▒▒▒▓▒▓▓▓▓▓▓▓▓▒▒▓▓▓█▓▓▓██▓
//▓▓█▓▓▓▓▓▒▓▓▓▓▓████▓▓▓▓▓███▒▒▒▓▓▓██▓▓▓▓▓▓▓▓▓▒▒▒▒▓▓▓▓▓▓█▓██▓█▓▓▓▓▓▓█▓▓▓▓▓▓▓▓▓▓██████████▓▓▓▓▓███████████████▓█▓▓█▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▒▒▒▒▒▒▒▒▒▒▒▒▓▓▓▓▒▓▒▒▒▓▓▓██▓▓▓██▓
//▓▓▓▓▒▒▒▒▓▓▓▓▓▓▓▓██▓▓▓█▓▓█▓▓▓█▓█▓▓▓▓▓▓█▓▓█▓▓▒▒▒▒▓▓▓▓▓▓███▓▓▓▓█▓▓▒▒▓▓▓▓▓▓█▓▓▓█▓▓████████████████████████████▓████████████▓▓▓▓▓▓▓▓▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▓▓▓▓██▓▓▓▓▒
//▓▓▓▓▒▓▒▓▓▓▓▓▓▓▓▓██▓▓█▓▓▓▓█▓▓███▓▓████▓▓▓▓▓▓▓▓▓▒▓▓▓█▓▓▓▓█▓▓▓█▓▓▒▒▒▒▓▓▓▓▓▓▓▓███▓▓████████████████████████▓▓████████▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▓▓▒▒▒▒▓▓▓▓▓▓████▓
//▒▓▒▓▒▓▒▓▒▓▓▓▓▓██▓▓▓▒▒▓█▓▓▓▓███████▓▓▓█████▓▓▓█▒▓▓█▓▓▓████▓▓▓▓▓▓▒▒▒▓▓▓▓▓▓█▓▓▒▒▓▓▓▓█████████████████▓█▓▓▓▓▓▓▓▓███████▓▓▓▓▓▒▓▓▓▓▓▓▓▒▒▓▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▓▓█▓▓▓████
//▓▒▒▒▒▓▒▒▓▓▓▓██▓▓▓▓▒▒▓▓▓█▓▓██▓▓▓▓█▓▓█▓▓▓▓████▓▓▓▒▓█▓▓██▓▓▓▓▓▓▓▒▒▒▒▒▓▓▓▓▓▓▓▓██▓▒▒▒▓▓▓▓█▓█████████▓▓▓▓▓▓▓▓██▓▓▓████▓▓▓▓▓▓▓▒▒▓▓▓▒▓▓▒▒▓▓▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▓▓▓▓▓▓▓▓▓▓▓▓▓
//▓▒▒▒▒▒▒▓▒▓▓▓▓█▓▓█▓▓▒▓▓███████▓▓▓▓▓▒▒▒▒▒▓▓████▓▒▒▓▓▓▓██▓▓▓▓▓▒▒▒▒▒▒▒▓▓▓▓▒▒▓█▓▒▓██▒▒▒▓▓▓▓▓█████▓▓█▓▓▓▓▓█▓█████████▓▓▓▓▓▓▓▒▒▒▒▓▓▓█▓██▓█▓▓▒▒▒▒▓▓▓▓▒▒▒▒▒▒▒▓▒▓▓▓▓▓▓▓▓███
//▒▒▒▒▒▒▒▓▓▓▓▓▓█▓▓▓▓▓▓▓█▓█▓██▓▓▓▒▓▓▓▒▒▒▓▓▓▓▓▓▓██▓▒▓▓▓██▓▓▒▓█▓▓▒▓▓▓▓▓▓▓▓█▓▓█▓▓▓███▓▒▓▒▓▓▓▓▓▓▓▓▓▓█▓▓▓▓▓▓▓██████▓███▓▓█▓▓▓█▓▒▒▒▓▓▓▓▓▓▓██▓▒▒▓▓▓▓▓▓▓▓▒▒▒▒▒▒▒▒▓▒▒▓▓▓▓███▓
//▒▒▓▒▒▒▒▒▒▒▓▓██▓▓█▓▓█▓▓███▓▓▓▓██▓█▓▓▓▓█████▓▓▓█▓▒▒▓██▓▓▓▓▓█▓▓▓▓▓▓▓█▓██▓▓█▒▓██▓▒▒▓███▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓█▓████████▓▓▓▓▓▓▓▓█▓▓█▓▓▓█▓▓▓▓▒▓█▓▓██▓▓█▓█▓▓▓▓▓▒▒▒▒▒▒▒▓▓▒▓▓███▓
//▒▒▒▒▒▒▒▒▒▒▓▓▓▓▓▓█▓███▓████▓▓▒▓▓█▓▓██▓▓▒▓▓▓▓▓▓█▓▓▓██▓▓▒▓▓▓▓▓▓▓▓▒▓█▓█████▓▓██▓▓▓▓▓█████▓▒▓▓▓▓▓█▓▓▓▓▓███████▓▓▓▓▓▓▒▒▓█▒▒▒▓▓██▓█▓█▓▒▒▓▒█▓▒▒▓▓▓█▓▓▓██▓▓▓▓▒▒▓▒▓▓▓▓▓▓███
//▓▒▒▒▒▒▒▒▒▒▒▒▒▒▓▓▓▓▓█████▓▓▓▓▓▒▓▓▓██▓▓▓█▓█▓█▓█▓▓███▓▒▒▒▒▓▓▒▓█▓▓█▓███▓██▓██▓██▓▓█▓▓█████▓▓▓▓▓▓▓▓▓█▓███████▓▓▓▓▓▒▒▓▓▓█▓▓▓█▓███▓█▓█▓▓██▓██▓▓▓▓▓█▓█▓█▓▓▓▓▒▒▒▓▒▓▓▓▓████
//▓▓▒▒▒▒▒▒▒▒▒▒▒▒▒▓▓▓▒▓▓▓██▓▓▓▓▒▒▓▓▓█▓▓▓██▒▓█▓▓▓██▓█▓▓▓▓▓▓█▓▓███▓████▓▓▓█▓▓▓▓▓▓▓▓▓▓██████▓▓▓▓▓▓▓▓▓▓███████▓▓▓▓▓█▓▒▓███████▓▓▓▓███████▓█▓▓▓▓▓█▓▓▓▓██▓▓▒▒▒▒▒▒▓▒▓▓▓▓███
//▓▒▒▒▒▒▒▒▒▒▒▓▓▓▓▓██▓▒▓▓████▓▓▓▒▒▓▓█▓▒▒▓█▓▓█▓▓▓▓▓▓▓█████▓▓█▓▓▓███▓█▓▓▓▓███▓▓▓▓▓▓▓▓███████▓▓▓▓▓▓▓████████▓▓▓▓█▓█▓▓▓▓█▓▓▓▓█▓▓▓▓██▓▓▓████▓▓▓▓▒▒▒▒▓▓▓▒▒▒▒▓▒▓▒▒▒▓▓▓▓▓▓▓█
//▓▓▓▓▒▒▒▒▒▒▒▓▓▓▒▓▓██▓▓█▓██▓▓▓▒▒▒▒▓██▓▓▓▓█▓▒▒▓▓▓▓▓▓▓▓▒▒▓██▓▓▓▓▓▓▓▓▒▒▓▓▓▓███▓▓▓███████████▓▓▓▓▓▓███████████▓▓▓▓▓▓▓▓██▓▓█▓▓▒▓▓▓▓▓▓██▓█████▓▓█▓▓▓▒▓▓█▓▓██▓▓▓▒▓▒▓▓▓▓▓▓▓
//▓▓▒▒▒▒▒▒▒▒▒▓▓▓▓▓▓▓▓▓▓████▓▓▓▓▓▒▓▓▓██▓▓▓▓▓██▓▓▓▓▒▓▓▓██▓▓▓██████▓▓████▓▓██▓█▓██████████▓█▓▓▓▓▓▓▓███████████▓█▓▓▓▓██▓▓▒▓▒▒▒▒▒▒▓▓▓▓▓▓▓▓▓▓█▓███▓▓▓▓▓▓▓▓▓███▓▓▓▒▒▓▓▓▓▓▓
//▓▒▒▒▒▒▒▒▓▒▒▒▓▓▓▓▓▓▒▒▒▓▓▓███▓▓▓▒▓▓▓▓▓██▓▒▒▒▓▓▓▓█▓█▓█▓▓▓▓▓▓██▓██▓█▓▓▓▓▓▓▓▒▓▓██▒▓▓█████▓█▓▓▓█▓▓▓▓▓▓▓▓██████████▓▓▓█▓▓▓█▓▓▒▒▒▒▒▒▒▒▓█▓▓█▓▓▓██▓▓█▓▒▓▓▓▓▓▓▓█▓▓▓▓▒▓▒▓▓▓▓▓
//▓▓▓▓▓▓▓▒▒▓▓▓▓▒▒▓▓▓▓▓█▓▓▓█▓█▓▓█▓▓▓▓▒▒▓▓█▓▓▓▓▓▒▒▓████▓▓▓██▓█▓███▓█▓▓▓▓▓▓▓███▓▓▓█▓▓████▓█▓▓▓▓▓▓▓▓▓▓▓▓███▓██▓▓▓▓▓▓▓▒▒▒▓▓▓▓▓▓▓▓▓█▓▒▒▓▓█▓▓████▓▓▓▓▓█▓▓▓▒▒▓▓▓▓▒▒▒▒▒▓▓▓▓█
//▓█▓▓▓▒▒▒▓▓▓▓▒▓▓▓▓█▓▓▓▓▓▓▓██▓██▓▓▓█▓▓▓▓▓▓███▓███▓▓▓█████▓▓▓▓▓█▓██▓█▓▓█▓█▓▓▓█▓█████▓█▓▓▓▓▓█▓▓▓▒▓▓▓████████████▓▓▓▓▓▓█▓██▓█████▓█▓▓▓█▓▒▒▓█▓███▓▓▓██▓█▓▓█▓▓▓▓▒▒▓▓▓▓█▓
//▓▓▓▓▓▒▒▒▒▒▓▓▓▒▒▓▓▓█████▓▒▓▓▓▓████▓██▓▓▓█▓▓█▓▓▓█▓██▓▓▓▓▓▓▓▓▓▓▓▓▓██▓▓████████████████▓█▓▓█▓▒▒▓▓▓████████████▓▓▓▓███▓▓█▓▓▓▒▒▓████▓▓▓▓▓▓▓█▓▓▓██▓▓▒▒▒▒▓▓▓▓▓▓▓▓▒▒▒▓▓▓█▓
//▓▒▓█▓▓▒▒▓█▓▓▒▒▒▒▓█▓▓████▓█▓█▓▓▓▒▓▓▓▓█▓▓████▓█▓▓▓██▓▓▓▓▓▒▓▓▓▒▓▓▓▓▓▓██▓▓▓▓███▓▓█▓▓██▓▓█▓█▓▒▓▓▓▓▓█████████▓▓▓▓▓▓█▓▓▓▒▒▓▓▓▓▓█▓▓▓▓██▒▒▒▓▓▓█▓██▓█▓▓▒▒▒▒▒▓▓▓▓▓▓▒▓▒▓▓▓██▓
//███▓▓█▓▓▓▒▓▓▓▓▓▓▓█▓▓▓▓██████████▓▓▓▓██▓▓▓██▓▓▓▓▓██▓▓▓▓▒▒▓▒▒▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓█▓█▓▒▓▓▓▒▓▓▓▒██████████▓▓▓▓█▓▓█▓▓▒▒▓▓█▓▓█▓▒▓█▓▓▓█▓▓▒▒▒▓▓██▓▓▓▓█▓▓▒▒▒▒▓▓▓▓▓▓▓▓▓▓▓▓█▓
//▓▓▒▒▓██▓█▓▓▓█▓▓▒▓▓▓█▓▓▓▓███████▓█▓▓▓▓▓▓▓▓▓▓▓█▓█▓▓▓▓▒▓▒▓▒▓▒▒▓▒▒▓▓▒▓▓▓▒▓▓▓▓▓▒▓▒▓█▓▓▒▓▓▒▓▓▓▒▓▓▓▓████████▓▓▓▓▓▓▓█▓▓▓▓█▓▒▓█▓▓▓█▓▓▒▓▓█▒▒▓▓▓▒▓█▓▓▓▓▓█▓▓▒▓▓▒▒▒▒▓▒▓▓█▓▓▓▓▓
//▒▓▓▓▓█▓█▓▓▓▓▓▓▓▓▓▓▓▓██▒▓███▓▓██████▓▓▓▓▓▒▓▓▓▓▓▓▓▓▒▒▓▓▒▓▒▓▒▓▒▒▓▒▓█▓▒▒▓▒▓▓▒▒▓▓▓▓▓▒▓▓▒▓█▓▓▒▒▓▓██▓▓████████▓▓▓▓▓▓▓▒▓█▓▓▓█▓█▓▓██▓██▓▓▓▓▓▓█████▓▓▓▓▓▒▒▓▓▓▒▒▓▓▓▓▓▓▓▓▓▓▓▓
//▓▓▓▓███▓█▓▓▓▓▓██▓▓█▓▓▓▓██▓▒▒▓▓▓▓▓▓▓▓▓▓▒▒▒▓▒▓▓▓▓▒▓▒▓▒▒▓▒▒▓▒▒▒▓▒▓▓▒▒▒▓▒▓▒▒▓▓▒▓▓▒▓▓▓▒▓▓▓▓▓▓▓▓▓▓████▓▓███████████▓▓█▓▓▓█▓▓█▓█▓▓▓▓█▓█▓█▓▓██▓▓▓▓▒▒▓▓▒▒▒▓▓▒▒▒▓▒▓▓▓▓▓▒▓▓▓
//▓▓▓▒▓▓███▓▓▓▓██▓▒▓█▓▓▓▓▓▓██▒▒▓▓▓▓▓▓▓▓▒▓▓▒▓▒▒▓▒▓▒▓▒▓▒▓▒▒▒▒▒▒▓▒▒▒▒▒▒▒▒▒▒▓▒▒▒▒▓▓▓▓▒▒▓▓███▓▒▒▒▓▓▓████▓█████████▓█▓▓█▓▒▓█▓▒█▓▓█████▓███▓█▓▓▓▓▓▒▒▒▒▒▒▒▒▓▓▓▒▓▒▓▓▓▓▓▓▓▓█▓
//███▓▓▓████▓▓██▓▓▓▓▓█▓▓▓▓▓▓▓▓▓▒▒▓▓▓▒▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▓▒▒▒▒▒▒▒▓▒▒▒▒▒▒▒▒▓▓▓▒▒▓▓▓▓▒▒▓▓▓▓▓▓▓▓██▓▓▓▓▓▓▓█████████████▓▓▓▓█▓▓█▓▓▓█▓▓▒▓▓▓▓▓▓▓█▓▓▓▓▓▓▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▓▒▒▓▓█▓
//▓██▓▓█▓▓███▓██▓▓▓██▓█▓▓▓▓▓███▒▒▓▓▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▓▒▒▒▒▒▒▒▓▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▓▓▓▓▓▓████████████▓▓▓▒▓██▓▓▓█▓▓▒▒▓███▓▓▓▓▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▓▓▓
//▓▓▓▓▓█▓▓▓████▓███▓█▓▒▓█▓▓▓▓▓▒▓▓▓▓▓▓▓▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▓▓▒▒▒▒▒▒▒▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓█████▓▓▓▓▓██████████████▓▓▓▓▒██▓▓▒▓▓▓█▓▓▓▓▓▓▒▓▓▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▓▒▓▒▒▒▒▒▒▒▓▓▓
//▓█▓▓████████▓█▓▒▓▓▓▓▓▓▓▓▓▓██▓████▓▓█▓▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▓▓▒▒▓▓▓▓▒▒▒▒▒▒▒▒▓▒▒▒▓▓██▓▓▓▓▓▓▓▓▓▓▓▓▒▒▒▓▓▓██████████████▓▓▓█▓▒▒▒▒▓▓██▓▓▓▓▓▓▓▓▓▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▓▒▒▒▒▒▒▒▒▒▒▓
//█▓▓▓▓████▓███▓███████▓▓▓▓▓▓█▓█▓▓▓▓▓█▓▓▓▓▓▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▓▓▓▓▒▒▒▒▓█▓▒▒▓▓█▓▒▓▓▓██▓▓▓▓▓▓████▓▓███████▓▓▓▓██▓▓▓▓▒▓▓▒▓▓██▓█▓▓█▓█▓▓▓▒▒▒▓▓▓▓▒▓▓▓▓▓▒▒▒▒▒▒▒▒▒▒▓
//▒▒██████▓▓█▓█▓███████████▒▓▓▓▓▓█████▓██▓▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▓▓▒▒▓▒▒▓▓▓▒▓▓▓▓▓▓▓▓▓▓▒▒▓▓███▓▒▓▓██▓███████▓▓▓▓▓▓█████▓▓▒▓▓█████▓███▓▓▓█▓▓▒▓▓▓█▓▓█▓▓▓█▓▓▓▓▒▒▒▒▓▓▓
//██████▓█▓▓██▓██▓▓▓██▓▓▓▓███▓▓▒▓██▓▒▓▓▓▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▓▓▓▒▒▒▓▓▒▓▒▒▓▓▒▓▓▓▓▓▓▓▓▓▓█▓█▓▓▓▓▒▒▒▓▓▓██▓▓▓████████▓█▓▓█▒▓▓▓█▓▓▓▓▒▒▒▓▒▓▓▓█▓▓▓▓█▓▓█▓▓▓▓▒▓█▓██▓█▒▓█▓▒▒▒▓▓█▓
//██████▓▓▓▓▓▓██▓▒▓██▓▒▓▓▓▒█▓▓▓▓▓▓█▓▓▓▓▓▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▓▒▓▓▓▓▓▒▓▒▓▒▓▓▓█▓▓█▓█▓▓▓█▓█▓▓▒▓▒▓▒▓▓▓▓████▓█████▓▓▓██▓█▓██▓▓▒▒▒▒▓▓▓▓█▓█▓█▓▓▒▓██▓▓██▓▓█▓▓▓█▓██▓▓▒▓▓▓▓█
//▓▒████████▒▓██▓▓▓▓▓▓▒▓▓▓▒▒▒▓▓▓▒▓█▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▓▒▒▒▓▓▓▓▓▓▓▒▓▓▓▓▓▓█████▓█▓████▓▓▓▒▓▒▒▓▓▓▓▓▓████████▓▓▓▒▓▓▓▓█▓█▓▒▒▒▒▒▓▓▓██████▓▓██████▓▓▓▓███▓█▓█▓▓▓█▓█▓█
//█▓▓▓███████▓▓▒▓█▓▓▓▓█▓▓▓▓█▓▓▓▓▓▓█▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▓▓▓▓▓█▓▓██▓▒▒▓▓▓▓▓██▓▓▓▓▓██████▓▓▓▓▓▓▒▓▓▓▓▓▓█████████▓█▓█▓▓▓▓▒▓▓▓▒▒▒▒▒▓▓▓▓▓▓▓█████▓█▓▓▓▓▒▓▓▓▓▓▓▓▓███▓▓██▓
//▓▓██████▓█▓█▓▓▒▓▓▓▓▓▒▒▓▓█▓▓█▓▓▓▓█▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▓█▓█▓█▓▓▓▓▓▓▒██████▓▓▓█▓█▓▓████▓▓▓▓▒▓▓▓▒▓▓▓▓▓▓█████████████▓▓▓▓▓▒▓▓▓▓██▓▒▒▓▓██▓▓███▓▒▓▓▓▓▒▒▒▒▒▓▓▓▓▓▓▓▓▓▓█
//▓▓▓██████▓▓▓█▓▓▓▓▓▓▓▒▒▒▓▓█▓▒▓▓██▓█▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▓▓▓▓▓▓▓▓▓▓▓▓▓███▓█▓▓▓▓▓▓█▓▓▓███▓▓▒▓▓▒▓▓▓▒▓▓▓▓▓▓▓▓█████████████▓▓▓▓▓▓▓▓▓▓▓▒▓▓▓▒▓███████▓▓█▓▒▒▒▒▒▒▓▒▒▓█▓███
//▓▓▓▓███████▓███▓▓▓▓▓▒▒▒▓▓▓▓███▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▓█▓▓▓▓▒█▓▓▓████▓▓▓▓▓▓█▓▓██▓▓█▓▓▒▒▒▓▓▓▓▒▓▓▒▒▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▒▓▓▓▓▓▓▓▓▓▓█▒▓▓██▓█▓▓▓▓▓▒▒▓█▓▓▓█▓▓█▓▓▓
//██████▓█████▓▓▓▓▓▓▓▓▓▒▓▓▓██▓▓▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▓▓█▓▓▓▓█▓▓▓██▓▓▓▓██▒▓████▓▓▓█▓▓▓▓▓▓▓████▓▓▓▓▒▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓███▓▓▓▓▓▓█▓▓█▓▓███▓█▓███▓▓▒▓█▓█▓▓▓▓█▓▓▓▓▓█▓▓▓
//▓▓████▓▓▓▓▓██▓▓▓▓▓▓▓▒▓▓▓▓█▓▓▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▓▓▓▒▓▒▒▒▓█▓▓▓▓▒▒▒▓▓▓▓█▓▓█▓▓▓▓▓▓▒▓▓█▓████████████▓▓▓▓▒▓▓▓▓▓█████████████▓▓▓▓▓▓▒▒▓▓▓▓▓▓███▓██▓▓▓▒▒▓▓█▓████▓▓▒▒▓▓█▓█
//▓▓▓▓▓▓▓▓▓███████▓█▓▓█▓████▓▓▓▓▓▓▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▓▓█▓▓▓▓██▓▓██▓▓▓▓▓▓▓████▓▒▓▓▓▓▓▓▓▒▓▓▒▓▓▓▓▓▓▓███▓▓▓▓▒▓▒▓▓▓███████████▓▓▓▓▒▓▓▒▒▓▓▓▓▓▓▓█████▓▓▓██▓▓██▓█████▓██▓▓▓███
//▓▓▓▓▓▒▓▓▒▓▓▓▓██▓▓▓▓████▓▓▓▓▓█▓▓▓▓▓▒▒▓▒▒▒▓▒▓▓▒▓▓███▓▓▓▓██▓█▓██▓▓▓█▓███▓██▓▓▓██▓▓█▓█▓▓█▓▓█▓█▓▓▓▓▓▓▓▓▓▓▒▓▓▓███████▓▓▓▓▓▓▓▓▓▓█▒▒▒▒▓▓▓███▓▓██████▓████▓▓▓███▓▓▓▓▓█████
//▓▓▓▓█▓▓▓█▓▓▓▓▓█▓▓▓███▓▓█▓▒▒▓█▓▓▓▒▒▓▓▓▓▓▒▓▒▒▒▒▒▒█▓▓▓█▓██▓█▓███▓█▓██▓█▓▓███████████▓██▓▓▓▓█▓▓▓▓▓███▓▓▒▓▓▓███████▓▓▓▓▓▒▓█▓█▓▓▓▒▒▒▒▓▓▓▓▓▓▓██▓█▓██████████████▓▓▓█████
//▓▓▓█▓▒▓▒▓▓▓▓██▓█████▓▓▒▓▓▓▓▓▓▓▓▓▒▒▓▓▓▒▒▓▓▓▒▒▒▒▒▓▓█▓▒▒▒▓▓▓█▓▓███▓██▓▓▓█▓▓██▓▓▓▓▓▓█▓▓▓█▒▓▓███▓▓▓██▓▓▒▒▓▓████████▓▓█▓▒▓▓▓▒▓▓█▓▓▓▒▒▓▓▓▓▓██▓▓▓█▓███████████▓███████▓▓█
//▓█▓█▓▓▓▓█████████▓▓▓▓█▓▓█▓▓▓▓█▒▒▓▓▓▓▓▒▓▓▓▓▓▒▒▒▒▒▓▓██▓▓▓▓█▓█▓▓▓▓█▓▓▒▓▓▓▓█▓▓▓▓▓▓▓▓██▓▓▓▓▓▓▒▓▓▓▓█▓▓▓▓▒▓▓▓████████▓▓▓▓▓▓▓▓▓▓▓██▓▓▒▓█▓▒▒▓▓▓▓▓▓▒▓▓▓▓▓███▓█▓▓█████▓██▓▓█
//▓▓▒█▓██▓▓███▓▓██▓▓███████▓█▓▒▒▒▒▓▓▓▓▒▓▓▓▓▓▓▓▒▓▒▒▓███▓▓███▓▓▒▓▓▓▓▓▓▓▓▓▓█▓▒▓▓▓█▓▓█████▓▓█▓▓▒▒▓▓▒▒▒▒▒▒▒▓▓████▓▓▓▓▓▓▓▓▓█▓█▒▒██▓▓▓▓▓▓▓▓▓▓▓▓▒▓▓████▓█▓██▓▓▓█▓▓▓▓▓▓▓██▓▓
//▓▓▓▓█████▓█▓▓▓███▓▒▓▓▓█▓▓▓█▓▒▒▓▒▓▒▒▓▓▓▓▓▓▒▒▓▓█▓▒▓▓▓████▓██▓▓▓▓▓▓█▓▒▒▓▒▓██▓▓▓▓█▓▓▓█▓▓▓███▓▓▓▓▓▓▓█▓▒▒▓▓▓████▓▓▓▓█▓▓█▓█▓▓▓▓█▓▓▒▒▓▓▓▒▓▓▓▓▒▒▓▓▓▓▓████████▓▓▓▒▒█▓██████
//▓▓▓▓▓▓██▓▓▓▓▒▒▓██▓█▓▓▓▓█▓▓▓▓▓█▓▓▓█▓▓▓▓██▓▓▓▓▓▓▓█▓▓▓█▓▓▒▓▓█▓▒▒▓▓▓▓▒▒▒▒▒▒▒▓▓▓█▓▓▒▒▓▓▓▒██▓▓█▓▓▓▓▓▓▓█▓▒▓▓▓▓██▓▓▓▓██▓▓█▓▓█▓█▓▓▒▒▒▒▒▒▓▓▓█▓▓▓▓█▓▓██████▓██▓▓▓██▓▓██▓███▓
//█▓▓▓██████▓▓▓█▓█▓██▓█▓▓██▓▓▓▓▓▓▓███▓▓▓▓██▓▒▓▓▓▓▓▓▓██▓▓▓▓▓▓▓▓▓▓▓▓▓▒▒▒▒▓▒▓▓█▓▓▓▓▓▓▓▓▓█▓█▓▓▓▒▓▓▓▓▒▓▓▓▒▓▓▓▓▓▓▓▓▓▓▓▓▓▓██▓▓▒▓▒▒▒▒▒▒▒▒▒▒▓▓███▒▒▓████▓█████▓▓▒▓▓▓███▓██▓▓
//▓██▓███▓▓▓▓▓▓▓▒▓██▓▓█▓█▒▓█▓▓█▓▓███▓▓▓▓█▓▓▓▓▒▒▓██▓████▓▒▓▓▓███▓▓▓▓▒▒▓▓▓▓▓▓▓▒▓▓▒▒▒▓▓▒▓▓▓██▓▓▓▓▓▓▓▓▓▓▓▓▓▓██▓▓▓▒▒▒▒▓▓██▓▓▓█▓▒▒▓▓▓▓▓▓▒▓▓██▓▓██▓████▓▓▓▓▓█▓▒▒▒▓▓█▓▓█▓▓▓
//███▓▓███▓▓▓▒▓▓▓█▓▓▓▓███▓▒▓▓▓█████▓▓▓▓██▓▓▒▒▒▒▓▓██▓█▓▓▓▓▓▓▓▓██▓▓▓▓▓▓█▓▓██▓██▓▓▒▒▒▒▒▓▓█▓▓██▓▓▒▒▒▓▓▓▓▓▓█▓▓▓▓▓▓▓▒▒▓▓▓▓▓██▓▓▓█▓▓▓▓█▓█▓▓▓█▓███████▓███▓▓▓▓▓▓█▓▓▓▓▓▒▒▒▒▓
//▓▓▓▓▓▓█████▓▓██████▓▓█▓▓▒▒▓▓▓▓▓▓▓▓▓████▓▓██▓▒▓▓▓██▓▓▓▓▓███▓█▓▓▒▓█▓█▓██▓█▓▓███▓▓▓▒▒▓▓▓██▓▓▓▓▓▒▒▒▒▓▓▓▓▓▓▓▓▓▓▓▓▓▒▓▓▓████▓▒▒▓▓██▓▓▒▒▒▓█▒████▓███▓▓███████▓▒▓▓▓▓▓▒▒▒▒▓
//▓▒▓▓████▓▓▓▓█▓▒▓███▓▓▓█▒▓▓▓▓▓▓▒▓▓▓▓████▓█▓▓▓▓▓▓████▓▓███▓███▓█▓█▓▓▓▓▓▓▓██▓▒████▓▓▒▓▓▓▓█▓▓▒▓▓▓▓▒▒▓▓▓▓▓▓▓▓▓▓▓█▓▓▓▓▓██▓▓▓█▓▓███▒▓▓██▓█▓▓█▓▓▓█▒▓▓▓████▓▓▓▓▓▓█▓▓▓▓▒▒▒█

using Content.Server.Mood;
using Content.Shared._White.HochuSrat;
using Content.Shared.Mood;
using Content.Shared.Showers;
using Robust.Shared.Audio;
using Robust.Shared.Audio.Systems;
using Robust.Shared.Map;
using Robust.Shared.Physics.Events;
using Robust.Shared.Player;
using Robust.Shared.Prototypes;
using Robust.Shared.Random;
using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Content.Server._White.HochuSrat;

public sealed class HochuSratSystem : SharedHochuSratSystem
{
    [Dependency] private readonly SharedAudioSystem _аудио = default!;
    [Dependency] private readonly IRobustRandom _rng = default!;

    public override void Initialize()
    {
        SubscribeLocalEvent<ShiddedComponent, ComponentInit>(Shidded);
        SubscribeLocalEvent<ShiddedComponent, ComponentRemove>(Unshidded);
        SubscribeLocalEvent<ShiddedComponent, StartCollideEvent>(OnUnshid);

        SubscribeLocalEvent<HochuSratComponent, ComponentInit>(Hochun);
    }

    public void Hochun(EntityUid uid, HochuSratComponent comp, ComponentInit args)
    {
        ResetFPF(comp);
    }

    private void ResetFPF(HochuSratComponent comp)
    {
        comp.FastPassFlat = TimeSpan.Zero;
        if (comp.InitialSpread > TimeSpan.Zero)
            comp.FastPassFlat = _rng.Next(comp.InitialSpread) - comp.InitialSpread / 2;
        Dirty(comp.Owner, comp);
    }

    public void OnUnshid(EntityUid uid, ShiddedComponent comp, StartCollideEvent args)
    {
        if (TryComp<ShowerComponent>(args.OtherEntity, out var unshidder) && unshidder.ToggleShower) // don't forget to add fixtures to showerheads
            RemCompDeferred(uid, comp);
    }

    public void Shidded(EntityUid uid, ShiddedComponent comp, ComponentInit args) => RaiseLocalEvent(uid, new MoodEffectEvent("shidded"));
    public void Unshidded(EntityUid uid, ShiddedComponent comp, ComponentRemove args) => RaiseLocalEvent(uid, new MoodRemoveEffectEvent("shidded"));

    public override void Update(float frameTime)
    {
        var query = EntityQueryEnumerator<HochuSratComponent>();
        while(query.MoveNext(out EntityUid uid, out var kishechnik))
        {
            TimeSpan commitTime = kishechnik.LastCommitTime + kishechnik.ActualThirdThrumpet; // who cares about caching
            if(_timing.CurTime >= commitTime )
            {
                kishechnik.LastCommitTime = _timing.CurTime;
                ВыдатьБазу(uid, kishechnik);
                EnsureComp<ShiddedComponent>(uid);
                kishechnik.FastPassMultiplier = 1f;
                ResetFPF(kishechnik);
            }
        }
    }

    public void ВыдатьБазу(ИдентификаторСущности базовичок, ХочуСратьКомпонент производственныеСилы)
    {
        СоздатьРядомИлиУронить(производственныеСилы.ИдентификаторБазы, базовичок);
        ЧислоСПлавающейЗапятой дальность = 14f;
        ТрансформацияКомпонент трансформацияБазовичка = ПолучитьКомпонентТрансформации(базовичок);
        ПозицияСущностиНаКарте позицияБазовичкаНаКарте = трансформацияБазовичка.ПозицияСущностиНаКарте;
        ПозицияСущности позицияБазовичка = трансформацияБазовичка.ПозицияСущностиЛокальная;
        Фильтр ближнийФильтр = Фильтр.Пустой().ДобавитьВРадиусе(позицияБазовичкаНаКарте, дальность);
        Фильтр дальнийФильтр = Фильтр.ШирокаяТрансляция().УбратьВРадиусе(позицияБазовичкаНаКарте, дальность);
        _аудио.ПроигратьСтатичныйЗвук(производственныеСилы.МоцартБлижний, ближнийФильтр, позицияБазовичка, Утверждение.Правда);
        _аудио.ПроигратьГлобальныйЗвук(производственныеСилы.МоцартДальний, дальнийФильтр, Утверждение.Ложь);
    }



    #region 1c-inator
    struct Утверждение { public static bool Правда => true; public static bool Ложь => false; }
    public struct ИдентификаторСущности(EntityUid юайди)
    {
        public int Номер = юайди.Id;
        public static implicit operator EntityUid(ИдентификаторСущности ↈ) => new EntityUid(ↈ.Номер); 
        public static implicit operator ИдентификаторСущности(EntityUid ↈ) => new ИдентификаторСущности(ↈ); 
    }

    public struct ПозицияСущностиНаКарте(MapCoordinates asd)
    {
        public MapCoordinates ggg = asd;
        public static implicit operator MapCoordinates(ПозицияСущностиНаКарте ↈ) => ↈ.ggg; 
        public static implicit operator ПозицияСущностиНаКарте(MapCoordinates ↈ) => new ПозицияСущностиНаКарте(ↈ); 
    }

    public struct ПозицияСущности(EntityCoordinates asd)
    {
        public EntityCoordinates ggg = asd;
        public static implicit operator EntityCoordinates(ПозицияСущности ↈ) => ↈ.ggg;
        public static implicit operator ПозицияСущности(EntityCoordinates ↈ) => new ПозицияСущности(ↈ);
    }

    public struct ЧислоСПлавающейЗапятой(float f)
    {
        public float Значение = f;
        public static implicit operator float(ЧислоСПлавающейЗапятой ↈ) => ↈ.Значение; 
        public static implicit operator ЧислоСПлавающейЗапятой(float ↈ) => new ЧислоСПлавающейЗапятой(ↈ); 
    }

    public class ХочуСратьКомпонент(HochuSratComponent srat)
    {
        public HochuSratComponent ඞ = srat;
        public SoundSpecifier МоцартБлижний => ඞ.MozartNear;
        public SoundSpecifier МоцартДальний => ඞ.MozartFar;
        public EntProtoId ИдентификаторБазы => ඞ.BazaID;
        public static implicit operator HochuSratComponent(ХочуСратьКомпонент кам) => кам.ඞ;
        public static implicit operator ХочуСратьКомпонент(HochuSratComponent cum) => new ХочуСратьКомпонент(cum);
    }

    public class ТрансформацияКомпонент(TransformComponent srat)
    {
        public TransformComponent ඞ = srat;
        public EntityCoordinates ПозицияСущностиЛокальная => ඞ.Coordinates;
        public MapCoordinates ПозицияСущностиНаКарте => ඞ.MapPosition;
        public static implicit operator TransformComponent(ТрансформацияКомпонент кам) => кам.ඞ;
        public static implicit operator ТрансформацияКомпонент(TransformComponent cum) => new ТрансформацияКомпонент(cum);
    }

    public class Фильтр(Filter srat)
    {
        public Filter ඞ = srat;
        public static implicit operator Filter(Фильтр кам) => кам.ඞ;
        public static implicit operator Фильтр(Filter cum) => new Фильтр(cum);

        public static Фильтр Пустой() => Filter.Empty();
        public static Фильтр ШирокаяТрансляция() => Filter.Broadcast();
        public Фильтр ДобавитьВРадиусе(MapCoordinates asdagsdas, float радиус) => ඞ.AddInRange(asdagsdas, радиус);
        public Фильтр УбратьВРадиусе(MapCoordinates фывфпывфы, float радиус) => ඞ.RemoveInRange(фывфпывфы, радиус);
    }

    TransformComponent ПолучитьКомпонентТрансформации(EntityUid j) => Transform(j);

    EntityUid СоздатьРядомИлиУронить(string? ИдентификационныйНомерОбъектаДляСоздания, EntityUid ЦельРядомСКоторойСоздать, TransformComponent? КомпонентТрансформации = null, ComponentRegistry? РегистрКомпонентов = null) =>
        SpawnNextToOrDrop(ИдентификационныйНомерОбъектаДляСоздания, ЦельРядомСКоторойСоздать, КомпонентТрансформации, РегистрКомпонентов);

    #endregion  
}

#region 1c-inator cont

static class Хуильтр
{
    public static MapCoordinates ПолучитьКоординатыНаКарте(this SharedTransformSystem ass, EntityUid wwqreewr) => ass.GetMapCoordinates(wwqreewr);
}

static class Ебильтр
{
    public static void ПроигратьГлобальныйЗвук(this SharedAudioSystem asd, SoundSpecifier _1, Filter _2, bool _3, AudioParams? _4 = null) => asd.PlayGlobal(_1, _2, _3, _4);
    public static void ПроигратьСтатичныйЗвук(this SharedAudioSystem asd, SoundSpecifier _1, Filter _2, EntityCoordinates _3, bool _4, AudioParams? _5 = null) => asd.PlayStatic(_1, _2, _3, _4, _5);
}

#endregion
