//▒▓▒▓▒▒▒▒▒▒▒▒▒▓▓██▒▒▓▓▓▒▒▓██▓█▓██▓▓▒▒▒▒▒▒▒▒▓▓▓▓▓▓▓█▓▓▒▓▓█▓████▓█████▓▒▓▓███▓▓▓▒▒▒▒▒▓▓▒▒▒▓▓▓▓▓▓▓█▓▓▓█▓▓▓██▓█▓▓▓▓▓▓▓▓██▓▓▓▓▓▓▓▓▓██▓█▓█▓████▓▓▓▓▓▒▒▓▓▓▓▓█████▓▓█▓▓▓█▓
//▒▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▒▒▒▒▒▒▒▒▒▒▓▓▒▓█▓▓▓▓▒▒▒▒▒▒▒▒▓▓▓▓██▒▓▓▓▒▒█▓▓▓███████▓▓▓█▓▓███▓▓▓▒▒▒▒▒▒▒▒▒▒▓▒▒▒▓▓██▓▒▓▓████▓▓▓▓█▓▒▒▒▒▓▓▓▓███▓▓▓███▓▓▓▓█▓▒▓▓▓████▓▓▓█▓▓▓▓▓████▓▓▓█▓▓█
//▒▓▓▓▓▓▓▓▓▓▓▓▓▓▒▒▓▓▓▓▓▒▓▒▒▓▓█▓█▓▒▒▒▒▒▒▒▒▒▒▓█▓█▓█▓▓▓▓▒▒▒▒▒▒▓▓▓▓█▓█████▓▒▒▒▓█▓▓█▓▓▓▒▒▒▒▒▒▒▒▒▒▒▓▓▓█▓█▓█▓▓▓█▓▓▒▓▓▒▒▒▒▒▒▒▓▒▓█▓▓▓▓▓▓█▓▓▓▓▓▒▒▓▓▓▓▓▓▓█▓▓▓▓▓▓██▓▓██▓▓█▓▓▓█▓
//▒▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▒▓▓▓▓▓▓▒▒▒▒▒▒▒▒▒▒▓▓██▓▓▓███▓▒▒▒▒▓▓▓▓▓▓▓███▓▓▓█▒▓█▓▓▓▒▓▓▓▓▓▓▓▒▒▒▒▒▒▒▒▓▓▓▓▓█▓██████▓▓▒▒▒▒▒▓▓▓▓▒▓█▓▓███▓██▓▓▓▒▒▒▓▓▓▓█▓▓▓▓▓▓██▓██████████▓▓▓▓
//▒▒▒▓▓▓▓▓▓▓███▓█▓█▓▓▓▓▓▓▓▓▓▓▓▒▒▒▓▒▒▒▒▒▒▒▒▒▒▓▓▓▓██▒▓█▓▒▒▒▓▓██▓▒▓▓▓███▓▓▓▓▓▓▓▓▓▓█▓▓▓▓▓▓▓▒▒▓▓▓▒▒▓▓▓▓████▓▓█▓█▓▓▓▓▒▓██▓█▓▓▓█▓▓▓█▓▓█▓▓▓▒▒▒██████▓▓▒▓▓▓▓▓█▓▓▓█▓▓█▓▓▓▓▓▓▓
//▓▒▒▒▓▓▓▓▓▓███▓██▓▓█▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▒▒▒▒▒▒▒▓▓▓▓█▓▓▓██▓▓▒▓▓▓██▓▓█▓█▓█▓█████▓▓▓▓▒▓██▓▒▒▓▓▓▓▓▓▓▓▓▒▓▓█▓███▓▓▓█▓▓▓▓▓▓█▓▒▒▓▓█▓▓▓██▓▓█▓▓▓▓▓▒██▓▒▓▓▓█▓▒▒▓█▓███▓▓▓█▒▓▓▓▒▒▒▒▓
//▓▓▒▒▒▓▓▓▓▓▓███▓█▓▓▓▓▓▓▓▓█▓▓▓▓▓▒▓▒▒▒▒▒▒▒▒▒▓▓▓█▓▓▓▓▓▓▓▓▓██▓██████████▓▓▓▓▓█▓▓█▓▓█▓▓█▓█▓█▓███▓▓▒▓▓▓███▓▒▓▓▓▓▒▒▓▓█▓▓█▓▓█▓▓█▓▓▓▓▓▓▓▓▓▓▓▓█▓▓█▓▓▓▓▓▓▓▓█▓█▓▓█▓▓▓▒▓▒▒▒▒▒▓▓
//▒▒▒▓▒▒▒▓▓▓▓▓▓▓▓▓▓▓▓▒▓▓▓▓▓▒▒▒▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▓▓▓▓███▓▓█▓▓▒▓██▓█▓▓█▓▓████▓▓▓▓▒▒▓█▓▓███▓▓▒▒▓███▓▓▓▓█▓▓▓▓▓▓▒▒▒▒▓█▓█▓▓█▓█▓▓▓▒▒▓▓▓▒▒▒▒▓▓██▓▓▓▓▓▓▓███▓▓▓▓▒▓▓▓▓▓▓▓▒▒▒▒▓█▓
//▓▓▓█▓▓▓▓▓▒▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓██▓▓▓▓▒▒▒▒▒▒▒▒▒▒▒▒▒▓▓█▓▓▓█████▓█████▓█▓███▓▓▓▓▓█▓▒▒▒▓▓▓▓█▓██▓▓███▓█▓▒▓█▓▓█▓▒▒▒▒▒▒▓▓▓▒▒▓█▒▓▓▓▓█████▓▓▒▒▒▒▒▒▓▓█▓█▓█▓▓█▓▓▓▒▒▒▓▓▓▓▓▓▓▒▓▓█▓██
//█▓▓███▓▒▓▓▓▒▓▓▓██▓███████▓▓▓▒▒▓▓▒▒▓▒▒▒▒▒▒▒▒▒▓▓▓█▓▓█▓████████▓▓▓▓████▓▒▓▓▓▒▒▒▒▒▓▓██▓▓▓█▓▓█▓▓█▓██▒▒▓▓▓▓▒▓▓▒▒▓▓▓▓▓▓▓▓▒▒▓▒▒▓▓▓▓▓▒▒▒▒▒▒▒▓▓▓▓▓▓█▓▓█████▓▒▒▓█▓▓▓▓▓▒▒███▓
//▒▓▓████▓▒▓▓▓▓▓███▓▓████▓▓▓▓▓▓▓▓▓▓▓▒▓▒▒▒▒▒▒▒▒▒▒▒▓▒▒▒▓▓▓██████▓▓▓█▓▓█▓█▓▒▒▒▒▒▒▓▓▓▓▓██▓▒█▓▓▓▓▓▓▒▓▓▓▓▓██▓█▓▓▓▒▓▓▓▓▓▓▓▓▓▓▓▓▒▓▓▓▓▓▓▒▒▒▒▒▓▓▒▓▒▒▒▓▒▓▓▓▓█▓▓▓██▓▓▓██▒▓▓▓█▒▓
//▓█████▓▓▓▓▓▓▓████▓▓▓▓██▓▓▓▓▓▓▓▓▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▓▓██▓▒▓████▓█▓▒▒▒▓▓▓▓▒▓▓▒▒▒▒▓▓▓▒▓▓█▓▓▓█▓▓█▓▓▒▓▓▓█▓▒▒█▒▒▒▒▓▓▓▓█▓▓█▓▓▓▓▓▓▓▓▓▓▓▓▓▓▒▒▓▒▓▓▒▒▒▒▒▓▓▓▓█▒▓██▓█▓▓▓███▓▓█▓▓█
//██████▓▓▓▓▓▓▓▓▓██████▓▓▓▓▓▒▓▓▒▒▓▓▒▓▓▒▒▒▒▒▒▒▒▒▒▒▓▓█▓▓█▓▓▓▓▓██▓▓▒▒▓█▓▓▓▓▓▓▓▓▓▓▓▓▓▓█▓█▓▓▒▓█▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓█▓██▓███▓▓██▓▓▓▓▓▓▓▓▓▒▓▒▒▒▒▒▒▓▒▒▒▒▓▓▓▓█▓█▓▓▓▓▓▓▓▓▓█▓▓▒▓█▓
//███▓▓▓▓▓▓▒▓▓▓▓█████▓▓▓▓▓▓▒▒▒▒▓▓█▓▓█▓▒▒▒▒▒▒▒▒▒▒▒▓▓▓█▓▓▓▓█▓███▓█▓▓▓▓▓▓▓▓▒▒▓▓▓▓▓█▓▓▓▓▓▓▓▓▓▓▓█▓▓▓████▓▓▓▓▓██████▓▓▓▓▓▓▓▒▓▓▓▓▓▒▓▓▓▓▓▓▓▓▒▒▒▒▒▒▒▒▒▓▒▓▓▓▓▓▓▓▓▒▒▓▓▓█▓▓▓██▓
//▓▓█▓▓▓▓▓▒▓▓▓▓▓████▓▓▓▓▓███▒▒▒▓▓▓██▓▓▓▓▓▓▓▓▓▒▒▒▒▓▓▓▓▓▓█▓██▓█▓▓▓▓▓▓█▓▓▓▓▓▓▓▓▓▓██████████▓▓▓▓▓███████████████▓█▓▓█▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▒▒▒▒▒▒▒▒▒▒▒▒▓▓▓▓▒▓▒▒▒▓▓▓██▓▓▓██▓
//▓▓▓▓▒▒▒▒▓▓▓▓▓▓▓▓██▓▓▓█▓▓█▓▓▓█▓█▓▓▓▓▓▓█▓▓█▓▓▒▒▒▒▓▓▓▓▓▓███▓▓▓▓█▓▓▒▒▓▓▓▓▓▓█▓▓▓█▓▓████████████████████████████▓████████████▓▓▓▓▓▓▓▓▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▓▓▓▓██▓▓▓▓▒
//▓▓▓▓▒▓▒▓▓▓▓▓▓▓▓▓██▓▓█▓▓▓▓█▓▓███▓▓████▓▓▓▓▓▓▓▓▓▒▓▓▓█▓▓▓▓█▓▓▓█▓▓▒▒▒▒▓▓▓▓▓▓▓▓███▓▓████████████████████████▓▓████████▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▓▓▒▒▒▒▓▓▓▓▓▓████▓
//▒▓▒▓▒▓▒▓▒▓▓▓▓▓██▓▓▓▒▒▓█▓▓▓▓███████▓▓▓█████▓▓▓█▒▓▓█▓▓▓████▓▓▓▓▓▓▒▒▒▓▓▓▓▓▓█▓▓▒▒▓▓▓▓█████████████████▓█▓▓▓▓▓▓▓▓███████▓▓▓▓▓▒▓▓▓▓▓▓▓▒▒▓▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▓▓█▓▓▓████
//▓▒▒▒▒▓▒▒▓▓▓▓██▓▓▓▓▒▒▓▓▓█▓▓██▓▓▓▓█▓▓█▓▓▓▓████▓▓▓▒▓█▓▓██▓▓▓▓▓▓▓▒▒▒▒▒▓▓▓▓▓▓▓▓██▓▒▒▒▓▓▓▓█▓█████████▓▓▓▓▓▓▓▓██▓▓▓████▓▓▓▓▓▓▓▒▒▓▓▓▒▓▓▒▒▓▓▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▓▓▓▓▓▓▓▓▓▓▓▓▓
//▓▒▒▒▒▒▒▓▒▓▓▓▓█▓▓█▓▓▒▓▓███████▓▓▓▓▓▒▒▒▒▒▓▓████▓▒▒▓▓▓▓██▓▓▓▓▓▒▒▒▒▒▒▒▓▓▓▓▒▒▓█▓▒▓██▒▒▒▓▓▓▓▓█████▓▓█▓▓▓▓▓█▓█████████▓▓▓▓▓▓▓▒▒▒▒▓▓▓█▓██▓█▓▓▒▒▒▒▓▓▓▓▒▒▒▒▒▒▒▓▒▓▓▓▓▓▓▓▓███
//▒▒▒▒▒▒▒▓▓▓▓▓▓█▓▓▓▓▓▓▓█▓█▓██▓▓▓▒▓▓▓▒▒▒▓▓▓▓▓▓▓██▓▒▓▓▓██▓▓▒▓█▓▓▒▓▓▓▓▓▓▓▓█▓▓█▓▓▓███▓▒▓▒▓▓▓▓▓▓▓▓▓▓█▓▓▓▓▓▓▓██████▓███▓▓█▓▓▓█▓▒▒▒▓▓▓▓▓▓▓██▓▒▒▓▓▓▓▓▓▓▓▒▒▒▒▒▒▒▒▓▒▒▓▓▓▓███▓
//▒▒▓▒▒▒▒▒▒▒▓▓██▓▓█▓▓█▓▓███▓▓▓▓██▓█▓▓▓▓█████▓▓▓█▓▒▒▓██▓▓▓▓▓█▓▓▓▓▓▓▓█▓██▓▓█▒▓██▓▒▒▓███▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓█▓████████▓▓▓▓▓▓▓▓█▓▓█▓▓▓█▓▓▓▓▒▓█▓▓██▓▓█▓█▓▓▓▓▓▒▒▒▒▒▒▒▓▓▒▓▓███▓
//▒▒▒▒▒▒▒▒▒▒▓▓▓▓▓▓█▓███▓████▓▓▒▓▓█▓▓██▓▓▒▓▓▓▓▓▓█▓▓▓██▓▓▒▓▓▓▓▓▓▓▓▒▓█▓█████▓▓██▓▓▓▓▓█████▓▒▓▓▓▓▓█▓▓▓▓▓███████▓▓▓▓▓▓▒▒▓█▒▒▒▓▓██▓█▓█▓▒▒▓▒█▓▒▒▓▓▓█▓▓▓██▓▓▓▓▒▒▓▒▓▓▓▓▓▓███
//▓▒▒▒▒▒▒▒▒▒▒▒▒▒▓▓▓▓▓█████▓▓▓▓▓▒▓▓▓██▓▓▓█▓█▓█▓█▓▓███▓▒▒▒▒▓▓▒▓█▓▓█▓███▓██▓██▓██▓▓█▓▓█████▓▓▓▓▓▓▓▓▓█▓███████▓▓▓▓▓▒▒▓▓▓█▓▓▓█▓███▓█▓█▓▓██▓██▓▓▓▓▓█▓█▓█▓▓▓▓▒▒▒▓▒▓▓▓▓████
//▓▓▒▒▒▒▒▒▒▒▒▒▒▒▒▓▓▓▒▓▓▓██▓▓▓▓▒▒▓▓▓█▓▓▓██▒▓█▓▓▓██▓█▓▓▓▓▓▓█▓▓███▓████▓▓▓█▓▓▓▓▓▓▓▓▓▓██████▓▓▓▓▓▓▓▓▓▓███████▓▓▓▓▓█▓▒▓███████▓▓▓▓███████▓█▓▓▓▓▓█▓▓▓▓██▓▓▒▒▒▒▒▒▓▒▓▓▓▓███
//▓▒▒▒▒▒▒▒▒▒▒▓▓▓▓▓██▓▒▓▓████▓▓▓▒▒▓▓█▓▒▒▓█▓▓█▓▓▓▓▓▓▓█████▓▓█▓▓▓███▓█▓▓▓▓███▓▓▓▓▓▓▓▓███████▓▓▓▓▓▓▓████████▓▓▓▓█▓█▓▓▓▓█▓▓▓▓█▓▓▓▓██▓▓▓████▓▓▓▓▒▒▒▒▓▓▓▒▒▒▒▓▒▓▒▒▒▓▓▓▓▓▓▓█
//▓▓▓▓▒▒▒▒▒▒▒▓▓▓▒▓▓██▓▓█▓██▓▓▓▒▒▒▒▓██▓▓▓▓█▓▒▒▓▓▓▓▓▓▓▓▒▒▓██▓▓▓▓▓▓▓▓▒▒▓▓▓▓███▓▓▓███████████▓▓▓▓▓▓███████████▓▓▓▓▓▓▓▓██▓▓█▓▓▒▓▓▓▓▓▓██▓█████▓▓█▓▓▓▒▓▓█▓▓██▓▓▓▒▓▒▓▓▓▓▓▓▓
//▓▓▒▒▒▒▒▒▒▒▒▓▓▓▓▓▓▓▓▓▓████▓▓▓▓▓▒▓▓▓██▓▓▓▓▓██▓▓▓▓▒▓▓▓██▓▓▓██████▓▓████▓▓██▓█▓██████████▓█▓▓▓▓▓▓▓███████████▓█▓▓▓▓██▓▓▒▓▒▒▒▒▒▒▓▓▓▓▓▓▓▓▓▓█▓███▓▓▓▓▓▓▓▓▓███▓▓▓▒▒▓▓▓▓▓▓
//▓▒▒▒▒▒▒▒▓▒▒▒▓▓▓▓▓▓▒▒▒▓▓▓███▓▓▓▒▓▓▓▓▓██▓▒▒▒▓▓▓▓█▓█▓█▓▓▓▓▓▓██▓██▓█▓▓▓▓▓▓▓▒▓▓██▒▓▓█████▓█▓▓▓█▓▓▓▓▓▓▓▓██████████▓▓▓█▓▓▓█▓▓▒▒▒▒▒▒▒▒▓█▓▓█▓▓▓██▓▓█▓▒▓▓▓▓▓▓▓█▓▓▓▓▒▓▒▓▓▓▓▓
//▓▓▓▓▓▓▓▒▒▓▓▓▓▒▒▓▓▓▓▓█▓▓▓█▓█▓▓█▓▓▓▓▒▒▓▓█▓▓▓▓▓▒▒▓████▓▓▓██▓█▓███▓█▓▓▓▓▓▓▓███▓▓▓█▓▓████▓█▓▓▓▓▓▓▓▓▓▓▓▓███▓██▓▓▓▓▓▓▓▒▒▒▓▓▓▓▓▓▓▓▓█▓▒▒▓▓█▓▓████▓▓▓▓▓█▓▓▓▒▒▓▓▓▓▒▒▒▒▒▓▓▓▓█
//▓█▓▓▓▒▒▒▓▓▓▓▒▓▓▓▓█▓▓▓▓▓▓▓██▓██▓▓▓█▓▓▓▓▓▓███▓███▓▓▓█████▓▓▓▓▓█▓██▓█▓▓█▓█▓▓▓█▓█████▓█▓▓▓▓▓█▓▓▓▒▓▓▓████████████▓▓▓▓▓▓█▓██▓█████▓█▓▓▓█▓▒▒▓█▓███▓▓▓██▓█▓▓█▓▓▓▓▒▒▓▓▓▓█▓
//▓▓▓▓▓▒▒▒▒▒▓▓▓▒▒▓▓▓█████▓▒▓▓▓▓████▓██▓▓▓█▓▓█▓▓▓█▓██▓▓▓▓▓▓▓▓▓▓▓▓▓██▓▓████████████████▓█▓▓█▓▒▒▓▓▓████████████▓▓▓▓███▓▓█▓▓▓▒▒▓████▓▓▓▓▓▓▓█▓▓▓██▓▓▒▒▒▒▓▓▓▓▓▓▓▓▒▒▒▓▓▓█▓
//▓▒▓█▓▓▒▒▓█▓▓▒▒▒▒▓█▓▓████▓█▓█▓▓▓▒▓▓▓▓█▓▓████▓█▓▓▓██▓▓▓▓▓▒▓▓▓▒▓▓▓▓▓▓██▓▓▓▓███▓▓█▓▓██▓▓█▓█▓▒▓▓▓▓▓█████████▓▓▓▓▓▓█▓▓▓▒▒▓▓▓▓▓█▓▓▓▓██▒▒▒▓▓▓█▓██▓█▓▓▒▒▒▒▒▓▓▓▓▓▓▒▓▒▓▓▓██▓
//███▓▓█▓▓▓▒▓▓▓▓▓▓▓█▓▓▓▓██████████▓▓▓▓██▓▓▓██▓▓▓▓▓██▓▓▓▓▒▒▓▒▒▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓█▓█▓▒▓▓▓▒▓▓▓▒██████████▓▓▓▓█▓▓█▓▓▒▒▓▓█▓▓█▓▒▓█▓▓▓█▓▓▒▒▒▓▓██▓▓▓▓█▓▓▒▒▒▒▓▓▓▓▓▓▓▓▓▓▓▓█▓
//▓▓▒▒▓██▓█▓▓▓█▓▓▒▓▓▓█▓▓▓▓███████▓█▓▓▓▓▓▓▓▓▓▓▓█▓█▓▓▓▓▒▓▒▓▒▓▒▒▓▒▒▓▓▒▓▓▓▒▓▓▓▓▓▒▓▒▓█▓▓▒▓▓▒▓▓▓▒▓▓▓▓████████▓▓▓▓▓▓▓█▓▓▓▓█▓▒▓█▓▓▓█▓▓▒▓▓█▒▒▓▓▓▒▓█▓▓▓▓▓█▓▓▒▓▓▒▒▒▒▓▒▓▓█▓▓▓▓▓
//▒▓▓▓▓█▓█▓▓▓▓▓▓▓▓▓▓▓▓██▒▓███▓▓██████▓▓▓▓▓▒▓▓▓▓▓▓▓▓▒▒▓▓▒▓▒▓▒▓▒▒▓▒▓█▓▒▒▓▒▓▓▒▒▓▓▓▓▓▒▓▓▒▓█▓▓▒▒▓▓██▓▓████████▓▓▓▓▓▓▓▒▓█▓▓▓█▓█▓▓██▓██▓▓▓▓▓▓█████▓▓▓▓▓▒▒▓▓▓▒▒▓▓▓▓▓▓▓▓▓▓▓▓
//▓▓▓▓███▓█▓▓▓▓▓██▓▓█▓▓▓▓██▓▒▒▓▓▓▓▓▓▓▓▓▓▒▒▒▓▒▓▓▓▓▒▓▒▓▒▒▓▒▒▓▒▒▒▓▒▓▓▒▒▒▓▒▓▒▒▓▓▒▓▓▒▓▓▓▒▓▓▓▓▓▓▓▓▓▓████▓▓███████████▓▓█▓▓▓█▓▓█▓█▓▓▓▓█▓█▓█▓▓██▓▓▓▓▒▒▓▓▒▒▒▓▓▒▒▒▓▒▓▓▓▓▓▒▓▓▓
//▓▓▓▒▓▓███▓▓▓▓██▓▒▓█▓▓▓▓▓▓██▒▒▓▓▓▓▓▓▓▓▒▓▓▒▓▒▒▓▒▓▒▓▒▓▒▓▒▒▒▒▒▒▓▒▒▒▒▒▒▒▒▒▒▓▒▒▒▒▓▓▓▓▒▒▓▓███▓▒▒▒▓▓▓████▓█████████▓█▓▓█▓▒▓█▓▒█▓▓█████▓███▓█▓▓▓▓▓▒▒▒▒▒▒▒▒▓▓▓▒▓▒▓▓▓▓▓▓▓▓█▓
//███▓▓▓████▓▓██▓▓▓▓▓█▓▓▓▓▓▓▓▓▓▒▒▓▓▓▒▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▓▒▒▒▒▒▒▒▓▒▒▒▒▒▒▒▒▓▓▓▒▒▓▓▓▓▒▒▓▓▓▓▓▓▓▓██▓▓▓▓▓▓▓█████████████▓▓▓▓█▓▓█▓▓▓█▓▓▒▓▓▓▓▓▓▓█▓▓▓▓▓▓▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▓▒▒▓▓█▓
//▓██▓▓█▓▓███▓██▓▓▓██▓█▓▓▓▓▓███▒▒▓▓▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▓▒▒▒▒▒▒▒▓▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▓▓▓▓▓▓████████████▓▓▓▒▓██▓▓▓█▓▓▒▒▓███▓▓▓▓▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▓▓▓
//▓▓▓▓▓█▓▓▓████▓███▓█▓▒▓█▓▓▓▓▓▒▓▓▓▓▓▓▓▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▓▓▒▒▒▒▒▒▒▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓█████▓▓▓▓▓██████████████▓▓▓▓▒██▓▓▒▓▓▓█▓▓▓▓▓▓▒▓▓▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▓▒▓▒▒▒▒▒▒▒▓▓▓
//▓█▓▓████████▓█▓▒▓▓▓▓▓▓▓▓▓▓██▓████▓▓█▓▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▓▓▒▒▓▓▓▓▒▒▒▒▒▒▒▒▓▒▒▒▓▓██▓▓▓▓▓▓▓▓▓▓▓▓▒▒▒▓▓▓██████████████▓▓▓█▓▒▒▒▒▓▓██▓▓▓▓▓▓▓▓▓▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▓▒▒▒▒▒▒▒▒▒▒▓
//█▓▓▓▓████▓███▓███████▓▓▓▓▓▓█▓█▓▓▓▓▓█▓▓▓▓▓▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▓▓▓▓▒▒▒▒▓█▓▒▒▓▓█▓▒▓▓▓██▓▓▓▓▓▓████▓▓███████▓▓▓▓██▓▓▓▓▒▓▓▒▓▓██▓█▓▓█▓█▓▓▓▒▒▒▓▓▓▓▒▓▓▓▓▓▒▒▒▒▒▒▒▒▒▒▓
//▒▒██████▓▓█▓█▓███████████▒▓▓▓▓▓█████▓██▓▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▓▓▒▒▓▒▒▓▓▓▒▓▓▓▓▓▓▓▓▓▓▒▒▓▓███▓▒▓▓██▓███████▓▓▓▓▓▓█████▓▓▒▓▓█████▓███▓▓▓█▓▓▒▓▓▓█▓▓█▓▓▓█▓▓▓▓▒▒▒▒▓▓▓
//██████▓█▓▓██▓██▓▓▓██▓▓▓▓███▓▓▒▓██▓▒▓▓▓▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▓▓▓▒▒▒▓▓▒▓▒▒▓▓▒▓▓▓▓▓▓▓▓▓▓█▓█▓▓▓▓▒▒▒▓▓▓██▓▓▓████████▓█▓▓█▒▓▓▓█▓▓▓▓▒▒▒▓▒▓▓▓█▓▓▓▓█▓▓█▓▓▓▓▒▓█▓██▓█▒▓█▓▒▒▒▓▓█▓
//██████▓▓▓▓▓▓██▓▒▓██▓▒▓▓▓▒█▓▓▓▓▓▓█▓▓▓▓▓▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▓▒▓▓▓▓▓▒▓▒▓▒▓▓▓█▓▓█▓█▓▓▓█▓█▓▓▒▓▒▓▒▓▓▓▓████▓█████▓▓▓██▓█▓██▓▓▒▒▒▒▓▓▓▓█▓█▓█▓▓▒▓██▓▓██▓▓█▓▓▓█▓██▓▓▒▓▓▓▓█
//▓▒████████▒▓██▓▓▓▓▓▓▒▓▓▓▒▒▒▓▓▓▒▓█▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▓▒▒▒▓▓▓▓▓▓▓▒▓▓▓▓▓▓█████▓█▓████▓▓▓▒▓▒▒▓▓▓▓▓▓████████▓▓▓▒▓▓▓▓█▓█▓▒▒▒▒▒▓▓▓██████▓▓██████▓▓▓▓███▓█▓█▓▓▓█▓█▓█
//█▓▓▓███████▓▓▒▓█▓▓▓▓█▓▓▓▓█▓▓▓▓▓▓█▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▓▓▓▓▓█▓▓██▓▒▒▓▓▓▓▓██▓▓▓▓▓██████▓▓▓▓▓▓▒▓▓▓▓▓▓█████████▓█▓█▓▓▓▓▒▓▓▓▒▒▒▒▒▓▓▓▓▓▓▓█████▓█▓▓▓▓▒▓▓▓▓▓▓▓▓███▓▓██▓
//▓▓██████▓█▓█▓▓▒▓▓▓▓▓▒▒▓▓█▓▓█▓▓▓▓█▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▓█▓█▓█▓▓▓▓▓▓▒██████▓▓▓█▓█▓▓████▓▓▓▓▒▓▓▓▒▓▓▓▓▓▓█████████████▓▓▓▓▓▒▓▓▓▓██▓▒▒▓▓██▓▓███▓▒▓▓▓▓▒▒▒▒▒▓▓▓▓▓▓▓▓▓▓█
//▓▓▓██████▓▓▓█▓▓▓▓▓▓▓▒▒▒▓▓█▓▒▓▓██▓█▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▓▓▓▓▓▓▓▓▓▓▓▓▓███▓█▓▓▓▓▓▓█▓▓▓███▓▓▒▓▓▒▓▓▓▒▓▓▓▓▓▓▓▓█████████████▓▓▓▓▓▓▓▓▓▓▓▒▓▓▓▒▓███████▓▓█▓▒▒▒▒▒▒▓▒▒▓█▓███
//▓▓▓▓███████▓███▓▓▓▓▓▒▒▒▓▓▓▓███▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▓█▓▓▓▓▒█▓▓▓████▓▓▓▓▓▓█▓▓██▓▓█▓▓▒▒▒▓▓▓▓▒▓▓▒▒▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▒▓▓▓▓▓▓▓▓▓▓█▒▓▓██▓█▓▓▓▓▓▒▒▓█▓▓▓█▓▓█▓▓▓
//██████▓█████▓▓▓▓▓▓▓▓▓▒▓▓▓██▓▓▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▓▓█▓▓▓▓█▓▓▓██▓▓▓▓██▒▓████▓▓▓█▓▓▓▓▓▓▓████▓▓▓▓▒▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓███▓▓▓▓▓▓█▓▓█▓▓███▓█▓███▓▓▒▓█▓█▓▓▓▓█▓▓▓▓▓█▓▓▓
//▓▓████▓▓▓▓▓██▓▓▓▓▓▓▓▒▓▓▓▓█▓▓▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▓▓▓▒▓▒▒▒▓█▓▓▓▓▒▒▒▓▓▓▓█▓▓█▓▓▓▓▓▓▒▓▓█▓████████████▓▓▓▓▒▓▓▓▓▓█████████████▓▓▓▓▓▓▒▒▓▓▓▓▓▓███▓██▓▓▓▒▒▓▓█▓████▓▓▒▒▓▓█▓█
//▓▓▓▓▓▓▓▓▓███████▓█▓▓█▓████▓▓▓▓▓▓▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▓▓█▓▓▓▓██▓▓██▓▓▓▓▓▓▓████▓▒▓▓▓▓▓▓▓▒▓▓▒▓▓▓▓▓▓▓███▓▓▓▓▒▓▒▓▓▓███████████▓▓▓▓▒▓▓▒▒▓▓▓▓▓▓▓█████▓▓▓██▓▓██▓█████▓██▓▓▓███
//▓▓▓▓▓▒▓▓▒▓▓▓▓██▓▓▓▓████▓▓▓▓▓█▓▓▓▓▓▒▒▓▒▒▒▓▒▓▓▒▓▓███▓▓▓▓██▓█▓██▓▓▓█▓███▓██▓▓▓██▓▓█▓█▓▓█▓▓█▓█▓▓▓▓▓▓▓▓▓▓▒▓▓▓███████▓▓▓▓▓▓▓▓▓▓█▒▒▒▒▓▓▓███▓▓██████▓████▓▓▓███▓▓▓▓▓█████
//▓▓▓▓█▓▓▓█▓▓▓▓▓█▓▓▓███▓▓█▓▒▒▓█▓▓▓▒▒▓▓▓▓▓▒▓▒▒▒▒▒▒█▓▓▓█▓██▓█▓███▓█▓██▓█▓▓███████████▓██▓▓▓▓█▓▓▓▓▓███▓▓▒▓▓▓███████▓▓▓▓▓▒▓█▓█▓▓▓▒▒▒▒▓▓▓▓▓▓▓██▓█▓██████████████▓▓▓█████
//▓▓▓█▓▒▓▒▓▓▓▓██▓█████▓▓▒▓▓▓▓▓▓▓▓▓▒▒▓▓▓▒▒▓▓▓▒▒▒▒▒▓▓█▓▒▒▒▓▓▓█▓▓███▓██▓▓▓█▓▓██▓▓▓▓▓▓█▓▓▓█▒▓▓███▓▓▓██▓▓▒▒▓▓████████▓▓█▓▒▓▓▓▒▓▓█▓▓▓▒▒▓▓▓▓▓██▓▓▓█▓███████████▓███████▓▓█
//▓█▓█▓▓▓▓█████████▓▓▓▓█▓▓█▓▓▓▓█▒▒▓▓▓▓▓▒▓▓▓▓▓▒▒▒▒▒▓▓██▓▓▓▓█▓█▓▓▓▓█▓▓▒▓▓▓▓█▓▓▓▓▓▓▓▓██▓▓▓▓▓▓▒▓▓▓▓█▓▓▓▓▒▓▓▓████████▓▓▓▓▓▓▓▓▓▓▓██▓▓▒▓█▓▒▒▓▓▓▓▓▓▒▓▓▓▓▓███▓█▓▓█████▓██▓▓█
//▓▓▒█▓██▓▓███▓▓██▓▓███████▓█▓▒▒▒▒▓▓▓▓▒▓▓▓▓▓▓▓▒▓▒▒▓███▓▓███▓▓▒▓▓▓▓▓▓▓▓▓▓█▓▒▓▓▓█▓▓█████▓▓█▓▓▒▒▓▓▒▒▒▒▒▒▒▓▓████▓▓▓▓▓▓▓▓▓█▓█▒▒██▓▓▓▓▓▓▓▓▓▓▓▓▒▓▓████▓█▓██▓▓▓█▓▓▓▓▓▓▓██▓▓
//▓▓▓▓█████▓█▓▓▓███▓▒▓▓▓█▓▓▓█▓▒▒▓▒▓▒▒▓▓▓▓▓▓▒▒▓▓█▓▒▓▓▓████▓██▓▓▓▓▓▓█▓▒▒▓▒▓██▓▓▓▓█▓▓▓█▓▓▓███▓▓▓▓▓▓▓█▓▒▒▓▓▓████▓▓▓▓█▓▓█▓█▓▓▓▓█▓▓▒▒▓▓▓▒▓▓▓▓▒▒▓▓▓▓▓████████▓▓▓▒▒█▓██████
//▓▓▓▓▓▓██▓▓▓▓▒▒▓██▓█▓▓▓▓█▓▓▓▓▓█▓▓▓█▓▓▓▓██▓▓▓▓▓▓▓█▓▓▓█▓▓▒▓▓█▓▒▒▓▓▓▓▒▒▒▒▒▒▒▓▓▓█▓▓▒▒▓▓▓▒██▓▓█▓▓▓▓▓▓▓█▓▒▓▓▓▓██▓▓▓▓██▓▓█▓▓█▓█▓▓▒▒▒▒▒▒▓▓▓█▓▓▓▓█▓▓██████▓██▓▓▓██▓▓██▓███▓
//█▓▓▓██████▓▓▓█▓█▓██▓█▓▓██▓▓▓▓▓▓▓███▓▓▓▓██▓▒▓▓▓▓▓▓▓██▓▓▓▓▓▓▓▓▓▓▓▓▓▒▒▒▒▓▒▓▓█▓▓▓▓▓▓▓▓▓█▓█▓▓▓▒▓▓▓▓▒▓▓▓▒▓▓▓▓▓▓▓▓▓▓▓▓▓▓██▓▓▒▓▒▒▒▒▒▒▒▒▒▒▓▓███▒▒▓████▓█████▓▓▒▓▓▓███▓██▓▓
//▓██▓███▓▓▓▓▓▓▓▒▓██▓▓█▓█▒▓█▓▓█▓▓███▓▓▓▓█▓▓▓▓▒▒▓██▓████▓▒▓▓▓███▓▓▓▓▒▒▓▓▓▓▓▓▓▒▓▓▒▒▒▓▓▒▓▓▓██▓▓▓▓▓▓▓▓▓▓▓▓▓▓██▓▓▓▒▒▒▒▓▓██▓▓▓█▓▒▒▓▓▓▓▓▓▒▓▓██▓▓██▓████▓▓▓▓▓█▓▒▒▒▓▓█▓▓█▓▓▓
//███▓▓███▓▓▓▒▓▓▓█▓▓▓▓███▓▒▓▓▓█████▓▓▓▓██▓▓▒▒▒▒▓▓██▓█▓▓▓▓▓▓▓▓██▓▓▓▓▓▓█▓▓██▓██▓▓▒▒▒▒▒▓▓█▓▓██▓▓▒▒▒▓▓▓▓▓▓█▓▓▓▓▓▓▓▒▒▓▓▓▓▓██▓▓▓█▓▓▓▓█▓█▓▓▓█▓███████▓███▓▓▓▓▓▓█▓▓▓▓▓▒▒▒▒▓
//▓▓▓▓▓▓█████▓▓██████▓▓█▓▓▒▒▓▓▓▓▓▓▓▓▓████▓▓██▓▒▓▓▓██▓▓▓▓▓███▓█▓▓▒▓█▓█▓██▓█▓▓███▓▓▓▒▒▓▓▓██▓▓▓▓▓▒▒▒▒▓▓▓▓▓▓▓▓▓▓▓▓▓▒▓▓▓████▓▒▒▓▓██▓▓▒▒▒▓█▒████▓███▓▓███████▓▒▓▓▓▓▓▒▒▒▒▓
//▓▒▓▓████▓▓▓▓█▓▒▓███▓▓▓█▒▓▓▓▓▓▓▒▓▓▓▓████▓█▓▓▓▓▓▓████▓▓███▓███▓█▓█▓▓▓▓▓▓▓██▓▒████▓▓▒▓▓▓▓█▓▓▒▓▓▓▓▒▒▓▓▓▓▓▓▓▓▓▓▓█▓▓▓▓▓██▓▓▓█▓▓███▒▓▓██▓█▓▓█▓▓▓█▒▓▓▓████▓▓▓▓▓▓█▓▓▓▓▒▒▒█

using Content.Server.Disposal.Unit.Components;
using Content.Server.Mood;
using Content.Shared._White.HochuSrat;
using Content.Shared.Alert;
using Content.Shared.Disposal;
using Content.Shared.DoAfter;
using Content.Shared.Mood;
using Content.Shared.Nutrition.Components;
using Content.Shared.Nutrition.EntitySystems;
using Content.Shared.Popups;
using Content.Shared.Showers;
using Content.Shared.Storage.EntitySystems;
using Content.Shared.Verbs;
using Robust.Shared.Audio;
using Robust.Shared.Audio.Systems;
using Robust.Shared.Containers;
using Robust.Shared.Map;
using Robust.Shared.Physics.Events;
using Robust.Shared.Player;
using Robust.Shared.Prototypes;
using Robust.Shared.Random;
using Robust.Shared.Timing;
using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Content.Server._White.HochuSrat;

public sealed class HochuSratSystem : SharedHochuSratSystem
{
    [Dependency] private readonly SharedAudioSystem _аудио = default!;
    [Dependency] private readonly SharedCreamPieSystem _cpSys = default!;
    [Dependency] private readonly AlertsSystem _alert = default!;
    [Dependency] private readonly IRobustRandom _rng = default!;

    public override void Initialize()
    {
        base.Initialize();
        SubscribeLocalEvent<ShiddedComponent, StartCollideEvent>(OnUnshid);
        SubscribeLocalEvent<HochuSratComponent, ComponentInit>(Hochun);
    }

    public void Hochun(EntityUid uid, HochuSratComponent comp, ComponentInit args)
    {
        ResetFPF(comp);
    }

    private void ResetFPF(HochuSratComponent comp)
    {
        comp.FastPassFlat = TimeSpan.Zero;
        comp.FastPassMultiplier = 1f;
        if (comp.InitialSpread > TimeSpan.Zero)
            comp.FastPassFlat = _rng.Next(comp.InitialSpread) - comp.InitialSpread / 2;
        Dirty(comp.Owner, comp);
    }

    public void OnUnshid(EntityUid uid, ShiddedComponent comp, StartCollideEvent args)
    {
        if (TryComp<ShowerComponent>(args.OtherEntity, out var unshidder) && unshidder.ToggleShower) // don't forget to add fixtures to showerheads
            RemCompDeferred(uid, comp);
    }



    public override void Update(float frameTime)
    {
        var query = EntityQueryEnumerator<HochuSratComponent>();
        while(query.MoveNext(out EntityUid uid, out var kishechnik))
        {
            TimeSpan curTime = _timing.CurTime;
            if (curTime >= kishechnik.ThirdThrumpetTime)
            {
                kishechnik.LastCommitTime = _timing.CurTime;
                TakeAShit(uid, true, comp: kishechnik);
                ResetFPF(kishechnik);
            }
            else if(curTime >= kishechnik.SecondThrumpetTime)
            {
                _alert.ShowAlert(uid, "ShatPants", 2);
            }
            else if (curTime >= kishechnik.FirstThrumpetTime)
            {
                _alert.ShowAlert(uid, "ShatPants", 1);
            }
            else
            {
                _alert.ClearAlert(uid, "ShatPants");
            }
        }
    }

    // at this point i will keep this as close to fully russian not out of principle, but spite
    private ИдентификаторСущности ВыдатьБазу(ИдентификаторСущности базовичок, ХочуСратьКомпонент производственныеСилы, bool СоЗвуком = true) // couldn't localise bool argument due to const-cumpiler bullshittery. It's so over.
    {
        ИдентификаторСущности Вкусняшка = СоздатьРядомИлиУронить(_rng.Pick(производственныеСилы.ИдентификаторыБазы), базовичок);
        ЧислоСПлавающейЗапятой дальность = 14f;
        ТрансформацияКомпонент трансформацияБазовичка = ПолучитьКомпонентТрансформации(базовичок);
        ПозицияСущностиНаКарте позицияБазовичкаНаКарте = трансформацияБазовичка.ПозицияСущностиНаКарте;
        ПозицияСущности позицияБазовичка = трансформацияБазовичка.ПозицияСущностиЛокальная;
        Фильтр ближнийФильтр = Фильтр.Пустой().ДобавитьВРадиусе(позицияБазовичкаНаКарте, дальность);
        Фильтр дальнийФильтр = Фильтр.ШирокаяТрансляция().УбратьВРадиусе(позицияБазовичкаНаКарте, дальность);
        if (СоЗвуком)
        {
            _аудио.ПроигратьСтатичныйЗвук(производственныеСилы.МоцартБлижний, ближнийФильтр, позицияБазовичка, Утверждение.Правда);
            _аудио.ПроигратьГлобальныйЗвук(производственныеСилы.МоцартДальний, дальнийФильтр, Утверждение.Ложь);
        }
        return Вкусняшка;
    }

    // hence this public wrapper because i am sick of doing these fucking comp wrappers
    public bool TakeAShit(EntityUid zasranets, bool comedy, bool sound = true, HochuSratComponent? comp = null)
        => TakeAShit(zasranets, comedy, out _, sound, comp);
    public bool TakeAShit(EntityUid zasranets, bool comedy, out EntityUid yummy, bool sound = true, HochuSratComponent? comp = null)
    {
        yummy = EntityUid.Invalid;
        if (!Resolve(zasranets, ref comp))
            return false;

        if (comedy && TryComp<CreamPiedComponent>(zasranets, out var CP))
            _cpSys.SetShidded(zasranets, CP, true);
        yummy = ВыдатьБазу(zasranets, comp, sound);
        return true;
    }


    #region 1c-inator
    public struct ИдентификаторСущности(EntityUid юайди)
    {
        public int Номер = юайди.Id;
        public static implicit operator EntityUid(ИдентификаторСущности ↈ) => new EntityUid(ↈ.Номер); 
        public static implicit operator ИдентификаторСущности(EntityUid ↈ) => new ИдентификаторСущности(ↈ); 
    }

    public struct ПозицияСущностиНаКарте(MapCoordinates asd)
    {
        public MapCoordinates ggg = asd;
        public static implicit operator MapCoordinates(ПозицияСущностиНаКарте ↈ) => ↈ.ggg; 
        public static implicit operator ПозицияСущностиНаКарте(MapCoordinates ↈ) => new ПозицияСущностиНаКарте(ↈ); 
    }

    public struct ПозицияСущности(EntityCoordinates asd)
    {
        public EntityCoordinates ggg = asd;
        public static implicit operator EntityCoordinates(ПозицияСущности ↈ) => ↈ.ggg;
        public static implicit operator ПозицияСущности(EntityCoordinates ↈ) => new ПозицияСущности(ↈ);
    }

    public struct ЧислоСПлавающейЗапятой(float f)
    {
        public float Значение = f;
        public static implicit operator float(ЧислоСПлавающейЗапятой ↈ) => ↈ.Значение; 
        public static implicit operator ЧислоСПлавающейЗапятой(float ↈ) => new ЧислоСПлавающейЗапятой(ↈ); 
    }

    public struct Утверждение(bool f)
    {
        public const bool Правда = true;
        public const bool Ложь = false;
        public bool Значение = f;
        public static implicit operator bool(Утверждение ↈ) => ↈ.Значение; 
        public static implicit operator Утверждение(bool ↈ) => new Утверждение(ↈ); 
    }

    public class ХочуСратьКомпонент(HochuSratComponent srat)
    {
        public HochuSratComponent ඞ = srat;
        public SoundSpecifier МоцартБлижний => ඞ.MozartNear;
        public SoundSpecifier МоцартДальний => ඞ.MozartFar;
        public List<EntProtoId> ИдентификаторыБазы => ඞ.BazaIDs;
        public static implicit operator HochuSratComponent(ХочуСратьКомпонент кам) => кам.ඞ;
        public static implicit operator ХочуСратьКомпонент(HochuSratComponent cum) => new ХочуСратьКомпонент(cum);
    }

    public class ТрансформацияКомпонент(TransformComponent srat)
    {
        public TransformComponent ඞ = srat;
        public EntityCoordinates ПозицияСущностиЛокальная => ඞ.Coordinates;
        public MapCoordinates ПозицияСущностиНаКарте => ඞ.MapPosition;
        public static implicit operator TransformComponent(ТрансформацияКомпонент кам) => кам.ඞ;
        public static implicit operator ТрансформацияКомпонент(TransformComponent cum) => new ТрансформацияКомпонент(cum);
    }

    public class Фильтр(Filter srat)
    {
        public Filter ඞ = srat;
        public static implicit operator Filter(Фильтр кам) => кам.ඞ;
        public static implicit operator Фильтр(Filter cum) => new Фильтр(cum);

        public static Фильтр Пустой() => Filter.Empty();
        public static Фильтр ШирокаяТрансляция() => Filter.Broadcast();
        public Фильтр ДобавитьВРадиусе(MapCoordinates asdagsdas, float радиус) => ඞ.AddInRange(asdagsdas, радиус);
        public Фильтр УбратьВРадиусе(MapCoordinates фывфпывфы, float радиус) => ඞ.RemoveInRange(фывфпывфы, радиус);
    }

    TransformComponent ПолучитьКомпонентТрансформации(EntityUid j) => Transform(j);

    EntityUid СоздатьРядомИлиУронить(string? ИдентификационныйНомерОбъектаДляСоздания, EntityUid ЦельРядомСКоторойСоздать, TransformComponent? КомпонентТрансформации = null, ComponentRegistry? РегистрКомпонентов = null) =>
        SpawnNextToOrDrop(ИдентификационныйНомерОбъектаДляСоздания, ЦельРядомСКоторойСоздать, КомпонентТрансформации, РегистрКомпонентов);

    #endregion  
}

#region 1c-inator cont

static class Хуильтр
{
    public static MapCoordinates ПолучитьКоординатыНаКарте(this SharedTransformSystem ass, EntityUid wwqreewr) => ass.GetMapCoordinates(wwqreewr);
}

static class Ебильтр
{
    public static void ПроигратьГлобальныйЗвук(this SharedAudioSystem asd, SoundSpecifier _1, Filter _2, bool _3, AudioParams? _4 = null) => asd.PlayGlobal(_1, _2, _3, _4);
    public static void ПроигратьСтатичныйЗвук(this SharedAudioSystem asd, SoundSpecifier _1, Filter _2, EntityCoordinates _3, bool _4, AudioParams? _5 = null) => asd.PlayStatic(_1, _2, _3, _4, _5);
}

#endregion



// 1:30AM i am a flesh automaton animated by neurotransmitters
public sealed class CanShitInsideEntitySystem : SharedCanShitInsideEntitySystem
{
    [Dependency] private readonly SharedDoAfterSystem _doafter = default!;
    [Dependency] private readonly SharedPopupSystem _popup = default!;
    [Dependency] private readonly HochuSratSystem _srat  = default!;
    [Dependency] private readonly SharedContainerSystem _cont = default!;
    [Dependency] private readonly SharedDisposalUnitSystem _disposalUnitSystem = default!;

    protected override void Shieet(EntityUid uid, CanShitInsideComponent comp, ShitDoAfterEvent args)
    {
        if(_srat.TakeAShit(args.User, false, out var bömb, false))
        {
            if (!TryComp<DisposalUnitComponent>(uid, out var disposals))
                QueueDel(bömb);
            _disposalUnitSystem.DoInsertDisposalUnit(uid, bömb, args.User, disposals);
        }
    }
}
